#include <stdio.h>  // เรียกใช้ไลบรารีสำหรับแสดงผลบนหน้าจอ (printf)

int main() {
    int a = 5, b = 17; // กำหนดค่าตัวแปร a และ b เป็นจำนวนเต็ม
    float c = 8.5, d = 4.0; // กำหนดค่าตัวแปร c และ d เป็นจำนวนจริง ทศนิยม

    printf("a = %d, b = %d, c = %3.1f, d = %3.1f\n", a, b, c, d); // แสดงค่าตัวแปรทั้งหมดที่กำหนดไว้ตั้งแต่แรก
    printf("d + a = %3.1f\n", d + a); // แสดงผลการบวกของ d กับ a  
    printf("a - b = %d\n", a - d); // แสดงผลการลบของ a กับ d
    printf("c * d = %3.1f\n", c * d); // แสดงผลการคูณของ c กับ d
    printf("a * c = %3.1f\n", a * c); // แสดงผลการคูณของ a กับ c
    printf("c / d = %3.1f\n", c / d); // แสดงผลการหารของ c กับ d
    printf("b / c = %3.1f\n", b / c); // แสดงผลการหารของ b กับ c
    printf("a %% b = %d\n", a % b);  // แสดงผลการหารเอาเศษของ a กับ b
    printf("(int)c %% a = %d\n", ((int)c) % a); // แสดงผลการหารเอาเศษของ c กับ a (ต้องแปลง c เป็น (int) ก่อน)
    printf("(int)c %% (int)d = %d\n", ((int)c) % ((int)d)); // แสดงการหารเอาเศษของ c กับ d (ต้องแปลงเป็น (int) ทั้งคู่)

    return 0;
}